# Напишите функцию fibonacci(index), которая находит число Фибоначчи с нужным номером. Аргумент функции index — целое положительное число.

# Последовательность Фибоначчи задается формулой:

# F(1) = 0

# F(2) = 1

# F(N) = F(N - 1) + F(N - 2) для N >= 3

# То есть, каждое последующее число равно сумме двух предыдущих чисел. Если требуется больше информации о данной последовательности, вы можете обратиться, например, к источнику.



def fibonacci(index):
    if index == 1:
        return 0
    if index == 2:
        return 1
    result = [0, 1]
    for i in range(3, index + 1):
        result.append(result[i - 2] + result[i - 3])
    return result[-1]


for n in range(11):
    print(f'fibonacci({n}) = {fibonacci(n)}')
