# Программа считывает со стандартного потока ввода полный путь к текстовому файлу. В файле содержится множество слов.

# Напишите программу, которая будет считывать и выводить, сколько раз встречается каждое слово. Формат вывода: в каждой строке количество вхождений слова, затем через пробел само слово. При выводе необходимо отсортировать слова следующим образом: от самых частых к самым редким, среди слов с одинаковым количеством вхождений — по алфавиту.

# Слово — последовательность символов, разделенных пробелами и концами строк. Если после слова следует знак препинания, то он также относится к слову.

# Примечание. Вы можете написать собственную функцию, реализующую сортировку, а можете воспользоваться функцией Python sorted().

words = dict()
file_path = input()
with open(file_path, 'r') as file:
    for line in file.readlines():
        for x in line.split():
            words.setdefault(x, 0)
            words[x] += 1

result = sorted(words.items(), key=lambda x: (-x[1], x[0]))
for word, counts in result:
    print(counts, word)
