def arm():
    n = input()
    if not n.isdigit():
        print('Не число')
        return
    n = int(n)
    s = n
    result = 0

    while(n != 0):
        a = n % 10
        result += a**3
        n //= 10

    if(result == s):
        print("Является")
    else:
        print("Не является")

arm()

# 0) Защита от дурака
# 1) Подсчет количество цифр в номере.
# 2) Доступ к каждой цифре с помощью mod и division
# 3) Каждая цифра повышается до степени числа цифр, и результат сохраняется в отдельной переменной
# 4) Шаги 2 и 3 повторяются до тех пор, пока цифры не исчерпаются
# 5) Проверка результата, рассчитанный с исходным номером
# 6) Благодарности)))
