# Программа считывает URL-адрес сайта (например, https://vk.com). 
# Определите, находится ли сайт в международном домене, и если нет, к какой стране он относится.

# Если домен является международным, выведите на экран слово «Международный». 
# Если домен является национальным, выведите на экран название страны.

# Варианты доменов, которые могут быть на входе:

# ●             .uk Великобритания

# ●             .de Германия

# ●             .il Израиль

# ●             .in Индия

# ●             .kz Казахстан

# ●             .mm Мьянма

# ●             .om Оман

# ●             .ru Россия

# ●             .uz Узбекистан

# ●             .et Эфиопия

# ●             .com Международный

# ●             .org Международный

# ●             .net Международный

country = {
    '.uk': 'Великобритания',
    '.de': 'Германия',
    '.in': 'Индия',
    '.kz': 'Казахстан',
    '.mm': 'Мьянма',
    '.om': 'Оман',
    '.ru': 'Россия',
    '.uz': 'Узбекистан',
    '.et': 'Эфиопия',
    '.com': 'Международный',
    '.org': 'Международный',
    '.net': 'Международный',
}

line = input().split('.')
print(country['.'+line[1]])

