# Даны N точек на прямой. У каждой известны координата X и масса M. 
# Задача: вывести координаты точек в порядке убывания массы.

# Программа считывает натуральное число N — количество точек. 
# Далее программа построчно считывает параметры для каждой n-ой точки: координату xi и массу mi. 
# Оба параметра являются целыми числами, масса является положительным числом. 
# Гарантируется, что строгого совпадения масс двух точек в считываемых данных не встречается.

# Программа должна вывести координаты xi точек, отсортированных по убыванию массы, каждая в новой строке.

N = int(input())
nums_list = [tuple(map(int, input().split()[:2])) for _ in range(N)]

nums_list.sort(key=lambda x: -x[1])

for i in range(N):
    print(nums_list[i][0])
